RIET/src/Reports/BillingSpecialistsDashboards/BillingSpecialistsDashboards.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>BillingSpecialistsDashboards</name>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/InformationRegisters/PlannersBillingSpecialistsMatching/PlannersBillingSpecialistsMatching.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PlannersBillingSpecialistsMatching</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>BillingSpecialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Planner</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/OBNoAndWONo/OBNoAndWONo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>OBNoAndWONo</name>
  <resources>
    <name>WO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>OBNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/Trip/Trip.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Trip</name>
  <registerRecords>AccumulationRegister.LocalDistributionCostsMilageWeightVolume</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerItem</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerKG</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionAccessorialCostsPerItem</registerRecords>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Draft</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseToList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysETAWithoutATA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroBaseCostsSum</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </attributes>
  <attributes>
    <name>DontSendInTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FinalDestinations</name>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Waybill</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ETA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ATA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DomesticOB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Urgency</name>
      <type>
        <types>EnumRef.Urgencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Gold</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Costs</name>
    <attributes>
      <name>CostType</name>
      <type>
        <types>CatalogRef.AccessorialCosts</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Reports/BillingSpecialistsDashboards/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Периодичность = Перечисления.Периодичность.Месяц;
	Отчет.ДатаОтчета	= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуПериодов(Периодичность, ДатаОтчета)
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("Интервал", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	
	НачалоПериода = НачалоМесяца(ДатаОтчета);
	КонецПериода  = НачалоПериода;
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		Стр = ТаблицаПериодов.Добавить();
		Стр.Интервал = НачалоПериода;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		НачалоПериода = НачалоКвартала(НачалоПериода);
		Для Счет = 1 по 3 Цикл
			
			Стр = ТаблицаПериодов.Добавить();
			Стр.Интервал = НачалоПериода;
			
			НачалоПериода = ДобавитьМесяц(НачалоПериода, 1);
			
		КонецЦикла;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		НачалоПериода = НачалоГода(НачалоПериода);
		Для Счет = 1 по 12 Цикл
			
			Стр = ТаблицаПериодов.Добавить();
			Стр.Интервал = НачалоПериода;
			
			НачалоПериода = ДобавитьМесяц(НачалоПериода, 1);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаПериодов;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере(); 

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Если Не ЗначениеЗаполнено(Отчет.ДатаОтчета) Тогда
		Отчет.ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет"); 
	РезультатТаб1.Очистить();
	ВывестиСхему(ОбъектОтчет, "BILLINGSPECIALISTBENCHMARK_1", РезультатТаб1);
	
	// отчет по Leg7
	Результат.Очистить(); 	
	ВывестиСхему(ОбъектОтчет, "LEG7BENCHMARK", Результат); 
	
	// отчет по Benchmark2
	РезультатТаб2.Очистить();
	ВывестиСхему(ОбъектОтчет, "BILLINGSPECIALISTBENCHMARK_2", РезультатТаб2); 

		
	////////
	// Чтобы не писалось "Отчет не сформирован…" 
	Элементы.РезультатТаб1.ОтображениеСостояния.Видимость = Ложь; 
	Элементы.РезультатТаб1.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;

	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь; 
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
	Элементы.РезультатТаб2.ОтображениеСостояния.Видимость = Ложь; 
	Элементы.РезультатТаб2.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;

	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВывестиСхему(ОбъектОтчет, ИмяМакета, ТабличныйДокумент)
	
	ВнешниеДанные = Новый Структура;
	Если ИмяМакета = "BILLINGSPECIALISTBENCHMARK_1" Тогда
		ВнешниеДанные.Вставить("Данные", ДанныеБенчмарк1(Отчет.Периодичность, Отчет.ДатаОтчета));
	ИначеЕсли ИмяМакета = "BILLINGSPECIALISTBENCHMARK_2" Тогда 
		
	Иначе
		ВнешниеДанные.Вставить("Данные", ДанныеLeg7(Отчет.Периодичность, Отчет.ДатаОтчета));	
	КонецЕсли;
	
	ОСКД = ОбъектОтчет.ПолучитьМакет(ИмяМакета); 
	ТекстЗапроса = Неопределено;
	Попытка 
		ТексЗапроса = ОСКД.НаборыДанных[0].Запрос;
	Исключение
	КонецПопытки;
	//
	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию; 
	//
	НастрйокаКолонки = Неопределено;
	Попытка
		НастройкаКолонки = НастройкиОСКД.Структура[0].Колонки[0].ПоляГруппировки.Элементы[0];
	Исключение
	КонецПопытки;
	
	Если Отчет.Периодичность = Перечисления.Периодичность.Месяц Тогда
		Если ТекстЗапроса <> Неопределено Тогда
			ТексЗапроса = СтрЗаменить(ТексЗапроса, "ГОД", "МЕСЯЦ");
		КонецЕсли;
		Если НЕ НастройкаКолонки = Неопределено Тогда
			НастройкаКолонки.НачалоПериода = НачалоМесяца(ТекущаяДата());
			НастройкаКолонки.КонецПериода  = КонецМесяца(ТекущаяДата());
		КонецЕсли;
	ИначеЕсли Отчет.Периодичность = Перечисления.Периодичность.Квартал Тогда
		Если ТекстЗапроса <> Неопределено Тогда
			ТексЗапроса = СтрЗаменить(ТексЗапроса, "ГОД", "КВАРТАЛ");
		КонецЕсли;
		Если НЕ НастройкаКолонки = Неопределено Тогда
			НастройкаКолонки.НачалоПериода = НачалоКвартала(ТекущаяДата());
			НастройкаКолонки.КонецПериода  = КонецКвартала(ТекущаяДата());
		КонецЕсли;
	Иначе
		Если НЕ НастройкаКолонки = Неопределено Тогда
			НастройкаКолонки.НачалоПериода = НачалоГода(ТекущаяДата());
			НастройкаКолонки.КонецПериода  = КонецГода(ТекущаяДата());
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстЗапроса <> Неопределено Тогда
		ОСКД.НаборыДанных[0].Запрос = ТексЗапроса;	
	КонецЕсли;
	
	ТекущаяДата = НастройкиОСКД.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
	Если ТекущаяДата <> Неопределено Тогда
		ТекущаяДата.Использование 	= Истина;
		ТекущаяДата.Значение 		= Отчет.ДатаОтчета;
	КонецЕсли;
	
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы; 
	
	ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных; 
	
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД,ДанныеРасшифровкиКомпоновкиДанных); 
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет, ВнешниеДанные,ДанныеРасшифровкиКомпоновкиДанных); 
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабличныйДокумент); 
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	Если ИмяМакета = "BILLINGSPECIALISTBENCHMARK_1" Тогда
		ДанныеРасшифровкиТаб1 = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, УникальныйИдентификатор);
	ИначеЕсли ИмяМакета = "BILLINGSPECIALISTBENCHMARK_2" Тогда 
		ДанныеРасшифровкиТаб2 = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, УникальныйИдентификатор);
	Иначе
		ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеБенчмарк1(Периодичность, ДатаОтчета)
	
	ТаблицаПериодов = ПолучитьТаблицуПериодов(Периодичность, ДатаОтчета);
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Интервалы.Интервал
	|ПОМЕСТИТЬ ТаблицаИнтервалов
	|ИЗ
	|	&Интервалы КАК Интервалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Trip,
	|	Данные.Sum,
	|	Данные.Specialist,
	|	Данные.BillingSpecialist КАК BillingSpecialist,
	|	Данные.Title,
	|	Данные.Month,
	|	Данные.SortIndex
	|ПОМЕСТИТЬ ИсходнаяВыборка
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripNonLawsonCompanies.Ссылка) КАК Trip,
	|		0 КАК Sum,
	|		TripNonLawsonCompanies.Specialist КАК Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist КАК BillingSpecialist,
	|		""Total trips verified by specialist"" КАК Title,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ) КАК Month,
	|		0 КАК SortIndex
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(TripNonLawsonCompanies.TotalCostsSumUSD / 1000),
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Total trips verified by specialist"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ),
	|		0
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripNonLawsonCompanies.Ссылка),
	|		0,
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Verified by specialist (current)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ),
	|		2
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|		И НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ) = НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(TripNonLawsonCompanies.TotalCostsSumUSD / 1000),
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Verified by specialist (current)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ),
	|		2
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|		И НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ) = НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripNonLawsonCompanies.Ссылка),
	|		0,
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Verified by specialist (previous period)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ),
	|		4
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist > TripNonLawsonCompanies.Closed
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(TripNonLawsonCompanies.TotalCostsSumUSD / 1000),
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Verified by specialist (previous period)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ),
	|		4
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist > TripNonLawsonCompanies.Closed
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.VerifiedByBillingSpecialist, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripNonLawsonCompanies.Ссылка),
	|		0,
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Not verified (current)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ),
	|		8
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist = ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(TripNonLawsonCompanies.TotalCostsSumUSD / 1000),
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Not verified (current)"",
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ),
	|		8
	|	ИЗ
	|		Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|	ГДЕ
	|		НЕ TripNonLawsonCompanies.ПометкаУдаления
	|		И TripNonLawsonCompanies.Проведен
	|		И TripNonLawsonCompanies.VerifiedByBillingSpecialist = ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1)
	|		И TripNonLawsonCompanies.Closed МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripNonLawsonCompanies.Ссылка),
	|		0,
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Not verified (previous period)"",
	|		ТаблицаИнтервалов.Интервал,
	|		10
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|			ПО (ТаблицаИнтервалов.Интервал > НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ))
	|				И (TripNonLawsonCompanies.Closed МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД))
	|				И (НЕ TripNonLawsonCompanies.ПометкаУдаления)
	|				И (TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1))
	|				И (TripNonLawsonCompanies.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		ТаблицаИнтервалов.Интервал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(TripNonLawsonCompanies.TotalCostsSumUSD / 1000),
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		""Not verified (previous period)"",
	|		ТаблицаИнтервалов.Интервал,
	|		10
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	|			ПО (ТаблицаИнтервалов.Интервал > НАЧАЛОПЕРИОДА(TripNonLawsonCompanies.Closed, МЕСЯЦ))
	|				И (TripNonLawsonCompanies.Closed МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД) И КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД))
	|				И (НЕ TripNonLawsonCompanies.ПометкаУдаления)
	|				И (TripNonLawsonCompanies.Closed <> ДАТАВРЕМЯ(1, 1, 1))
	|				И (TripNonLawsonCompanies.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripNonLawsonCompanies.Specialist,
	|		TripNonLawsonCompanies.BillingSpecialist,
	|		ТаблицаИнтервалов.Интервал) КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Trip,
	|	Т.Sum,
	|	ВЫБОР
	|		КОГДА НЕ Т.BillingSpecialist ЕСТЬ NULL  И НЕ Т.BillingSpecialist = Значение(Справочник.Пользователи.ПустаяСсылка)
	|				И НЕ Т.BillingSpecialist = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Т.BillingSpecialist
	|		КОГДА PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist ЕСТЬ NULL
	|			ТОГДА Т.Specialist
	|		ИНАЧЕ PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist
	|	КОНЕЦ КАК Specialist,
	|	Т.Title,
	|	Т.Month,
	|	Т.SortIndex
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсходнаяВыборка.Trip КАК Trip,
	|		ИсходнаяВыборка.Sum КАК Sum,
	|		ИсходнаяВыборка.Specialist КАК Specialist,
	|		ИсходнаяВыборка.BillingSpecialist КАК BillingSpecialist,
	|		ИсходнаяВыборка.Title КАК Title,
	|		ИсходнаяВыборка.Month КАК Month,
	|		ИсходнаяВыборка.SortIndex КАК SortIndex
	|	ИЗ
	|		ИсходнаяВыборка КАК ИсходнаяВыборка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ИсходнаяВыборка.Trip),
	|		СУММА(0),
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		""Total TRIP closed"",
	|		ИсходнаяВыборка.Month,
	|		6
	|	ИЗ
	|		ИсходнаяВыборка КАК ИсходнаяВыборка
	|	ГДЕ
	|		ИсходнаяВыборка.Title В (""Verified by specialist (current)"", ""Verified by specialist (current)"", ""Verified by specialist (previous period)"", ""Verified by specialist (previous period)"")
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		ИсходнаяВыборка.Month
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(0),
	|		СУММА(ИсходнаяВыборка.Sum),
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		""Total TRIP closed"",
	|		ИсходнаяВыборка.Month,
	|		6
	|	ИЗ
	|		ИсходнаяВыборка КАК ИсходнаяВыборка
	|	ГДЕ
	|		ИсходнаяВыборка.Title В (""Verified by specialist (current)"", ""Verified by specialist (current)"", ""Verified by specialist (previous period)"", ""Verified by specialist (previous period)"")
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИсходнаяВыборка.Month,
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ИсходнаяВыборка.Trip),
	|		СУММА(0),
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		""Total TRIP pending"",
	|		ИсходнаяВыборка.Month,
	|		12
	|	ИЗ
	|		ИсходнаяВыборка КАК ИсходнаяВыборка
	|	ГДЕ
	|		ИсходнаяВыборка.Title В (""Not verified (current)"", ""Not verified (previous period)"")
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		ИсходнаяВыборка.Month
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(0),
	|		СУММА(ИсходнаяВыборка.Sum),
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist,
	|		""Total TRIP pending"",
	|		ИсходнаяВыборка.Month,
	|		12
	|	ИЗ
	|		ИсходнаяВыборка КАК ИсходнаяВыборка
	|	ГДЕ
	|		ИсходнаяВыборка.Title В (""Not verified (current)"", ""Not verified (previous period)"")
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИсходнаяВыборка.Month,
	|		ИсходнаяВыборка.Specialist,
	|		ИсходнаяВыборка.BillingSpecialist) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.PlannersBillingSpecialistsMatching.СрезПоследних КАК PlannersBillingSpecialistsMatchingСрезПоследних
	|		ПО Т.Specialist = PlannersBillingSpecialistsMatchingСрезПоследних.Planner";
	
	Запрос.УстановитьПараметр("Интервалы", ТаблицаПериодов);
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаОтчета);
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГОД", "МЕСЯЦ");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Показатели = Новый Массив;
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Total trips verified by specialist", 0));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Verified by specialist (current)", 2));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Verified by specialist (previous period)", 4));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Total TRIP closed", 6));  	
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Not verified (current)", 8));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Not verified (previous period)", 10)); 
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Total TRIP pending", 12));
	
	Для каждого ТекПоказатель из Показатели Цикл
		
		Если ТаблицаДанных.Найти(ТекПоказатель.Показатель, "Title") = Неопределено Тогда
			
			Стр = ТаблицаДанных.Добавить();
			Стр.Title 	  = ТекПоказатель.Показатель;
			Стр.sortIndex = ТекПоказатель.Индекс;
			Стр.Month 	  = НачалоМесяца(ТекущаяДата());	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеLeg7(Периодичность, ДатаОтчета)
		
	ТаблицаПериодов = ПолучитьТаблицуПериодов(Периодичность, ДатаОтчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаОтчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Интервалы.Интервал
	|ПОМЕСТИТЬ ТаблицаИнтервалов
	|ИЗ
	|	&Интервалы КАК Интервалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Source.Trip,
	|	Source.Title,
	|	Source.Specialist,
	|	Source.Month,
	|	Source.SortIndex
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripFinalDestinations.Ссылка) КАК Trip,
	|		""Sent to TMS (SH exist) period = ATA"" КАК Title,
	|		TripFinalDestinations.Ссылка.Specialist КАК Specialist,
	|		ТаблицаИнтервалов.Интервал КАК Month,
	|		0 КАК SortIndex
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.FinalDestinations КАК TripFinalDestinations
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|					ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
	|						И (TripDomesticOB.Ссылка.Проведен)
	|				ПО TripFinalDestinations.Ссылка = TripDomesticOB.Ссылка
	|			ПО (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) = ТаблицаИнтервалов.Интервал)
	|				И (TripFinalDestinations.Ссылка.DomesticOBSentToTMS)
	|				И (НЕ OBNoAndWONo.WO ЕСТЬ NULL)
	|				И (НЕ TripFinalDestinations.Ссылка.ПометкаУдаления)
	|				И (TripFinalDestinations.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripFinalDestinations.Ссылка),
	|		""Sent to TMS from previous period"",
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал,
	|		1
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.FinalDestinations КАК TripFinalDestinations
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|					ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
	|				ПО TripFinalDestinations.Ссылка = TripDomesticOB.Ссылка
	|					И (TripDomesticOB.Ссылка.Проведен)
	|			ПО (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) < ТаблицаИнтервалов.Интервал)
	|				И (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(ТаблицаИнтервалов.Интервал, ГОД))
	|				И (TripFinalDestinations.Ссылка.DomesticOBSentToTMS)
	|				И (НЕ OBNoAndWONo.WO ЕСТЬ NULL)
	|				И (НЕ TripFinalDestinations.Ссылка.ПометкаУдаления)
	|				И (TripFinalDestinations.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripFinalDestinations.Ссылка),
	|		""Not processed to TMS"",
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал,
	|		3
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.FinalDestinations КАК TripFinalDestinations
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|					ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
	|				ПО TripFinalDestinations.Ссылка = TripDomesticOB.Ссылка
	|			ПО (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) = ТаблицаИнтервалов.Интервал)
	|				И (НЕ TripFinalDestinations.Ссылка.DomesticOBSentToTMS)
	|				И (НЕ OBNoAndWONo.WO ЕСТЬ NULL)
	|				И (НЕ TripFinalDestinations.Ссылка.ПометкаУдаления)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripFinalDestinations.Ссылка),
	|		""No SH in TMS"",
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал,
	|		4
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.FinalDestinations КАК TripFinalDestinations
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|					ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
	|				ПО TripFinalDestinations.Ссылка = TripDomesticOB.Ссылка
	|			ПО (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) = ТаблицаИнтервалов.Интервал)
	|				И (TripFinalDestinations.Ссылка.DomesticOBSentToTMS)
	|				И (OBNoAndWONo.WO ЕСТЬ NULL)
	|				И (НЕ TripFinalDestinations.Ссылка.ПометкаУдаления)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ TripFinalDestinations.Ссылка),
	|		""Pending from previous period"",
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал,
	|		5
	|	ИЗ
	|		ТаблицаИнтервалов КАК ТаблицаИнтервалов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.FinalDestinations КАК TripFinalDestinations
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|					ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
	|				ПО TripFinalDestinations.Ссылка = TripDomesticOB.Ссылка
	|					И (TripDomesticOB.Ссылка.Проведен)
	|			ПО (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) < ТаблицаИнтервалов.Интервал)
	|				И (НАЧАЛОПЕРИОДА(TripFinalDestinations.ATA, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(ТаблицаИнтервалов.Интервал, ГОД))
	|				И (TripFinalDestinations.Ссылка.DomesticOBSentToTMS)
	|				И (OBNoAndWONo.WO ЕСТЬ NULL)
	|				И (НЕ TripFinalDestinations.Ссылка.ПометкаУдаления)
	|				И (TripFinalDestinations.Ссылка.Проведен)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		TripFinalDestinations.Ссылка.Specialist,
	|		ТаблицаИнтервалов.Интервал) КАК Source
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеДанные.Trip,
	|	ИсходныеДанные.Title,
	|	ВЫБОР
	|		КОГДА PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist ЕСТЬ NULL
	|			ТОГДА ИсходныеДанные.Specialist
	|		ИНАЧЕ PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist
	|	КОНЕЦ КАК Specialist,
	|	ИсходныеДанные.Month,
	|	ИсходныеДанные.SortIndex
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.PlannersBillingSpecialistsMatching.СрезПоследних(&ТекущаяДата, ) КАК PlannersBillingSpecialistsMatchingСрезПоследних
	|		ПО ИсходныеДанные.Specialist = PlannersBillingSpecialistsMatchingСрезПоследних.Planner
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанные.Trip,
	|	""Total proccessed"",
	|	ВЫБОР
	|		КОГДА PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist ЕСТЬ NULL
	|			ТОГДА ИсходныеДанные.Specialist
	|		ИНАЧЕ PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist
	|	КОНЕЦ КАК Specialist,
	|	ИсходныеДанные.Month,
	|	2
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.PlannersBillingSpecialistsMatching.СрезПоследних(&ТекущаяДата, ) КАК PlannersBillingSpecialistsMatchingСрезПоследних
	|		ПО ИсходныеДанные.Specialist = PlannersBillingSpecialistsMatchingСрезПоследних.Planner
	|ГДЕ
	|	ИсходныеДанные.Title В (""Sent to TMS (SH exist) period = ATA"", ""Sent to TMS from previous period"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходныеДанные.Trip,
	|	""Total pending"",
	|	ВЫБОР
	|		КОГДА PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist ЕСТЬ NULL
	|			ТОГДА ИсходныеДанные.Specialist
	|		ИНАЧЕ PlannersBillingSpecialistsMatchingСрезПоследних.BillingSpecialist
	|	КОНЕЦ КАК Specialist,
	|	ИсходныеДанные.Month,
	|	6
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.PlannersBillingSpecialistsMatching.СрезПоследних(&ТекущаяДата, ) КАК PlannersBillingSpecialistsMatchingСрезПоследних
	|		ПО ИсходныеДанные.Specialist = PlannersBillingSpecialistsMatchingСрезПоследних.Planner
	|ГДЕ
	|	ИсходныеДанные.Title В (""Not processed to TMS"", ""No SH in TMS"", ""Pending from previous period"")";
	
	Запрос.УстановитьПараметр("Интервалы", ТаблицаПериодов);
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаОтчета);
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГОД", "МЕСЯЦ");
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Показатели = Новый Массив;
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Sent to TMS (SH exist) period = ATA", 0));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Sent to TMS from previous period", 1));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Total proccessed", 2)); 
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Not processed to TMS", 3));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "No SH in TMS", 4));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Pending from previous period", 5));
	Показатели.Добавить(Новый Структура("Показатель, Индекс", "Total pending", 6)); 
	
	Для каждого ТекПоказатель из Показатели Цикл
		
		Если ТаблицаДанных.Найти(ТекПоказатель.Показатель, "Title") = Неопределено Тогда
			
			Стр = ТаблицаДанных.Добавить();
			Стр.Title 	  = ТекПоказатель.Показатель;
			Стр.sortIndex = ТекПоказатель.Индекс;
			Стр.Month 	  = НачалоМесяца(ТекущаяДата());	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаКлиенте
Процедура РезультатТаб1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДеталиРасшифровки = Новый Структура;	
	ПолучитьРасшифровкуНаСервере(Расшифровка, ДеталиРасшифровки, 2);
	
	Если ДеталиРасшифровки.Количество() > 0
		И ДеталиРасшифровки.Свойство("Month") Тогда
		
		ДеталиРасшифровки.Вставить("ДатаОтчета", Отчет.ДатаОтчета);
		ДеталиРасшифровки.Вставить("Периодичность", Отчет.Периодичность);
		ДеталиРасшифровки.Вставить("ИмяСхемы", "BillingDashboardBenchmark1");
		
		// открываем детализирующий отчет
		ОткрытьФорму("Отчет.DashboardsDetalization.Форма.ФормаОтчета", Новый Структура("Отбор", ДеталиРасшифровки), ЭтаФорма, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатТаб2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДеталиРасшифровки = Новый Структура;	
	ПолучитьРасшифровкуНаСервере(Расшифровка, ДеталиРасшифровки, 3);
	
	Если ДеталиРасшифровки.Количество() > 0 Тогда
		
		ДеталиРасшифровки.Вставить("ДатаОтчета", Отчет.ДатаОтчета);
		ДеталиРасшифровки.Вставить("Периодичность", Отчет.Периодичность);
		ДеталиРасшифровки.Вставить("ИмяСхемы", "BillingDashboardBenchmark2");
		
		// открываем детализирующий отчет
		ОткрытьФорму("Отчет.DashboardsDetalization.Форма.ФормаОтчета", Новый Структура("Отбор", ДеталиРасшифровки), ЭтаФорма, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДеталиРасшифровки = Новый Структура;	
	ПолучитьРасшифровкуНаСервере(Расшифровка, ДеталиРасшифровки, 1);
	
	Если ДеталиРасшифровки.Количество() > 0
		И ДеталиРасшифровки.Свойство("Month") Тогда
		
		ДеталиРасшифровки.Вставить("ДатаОтчета", Отчет.ДатаОтчета);
		ДеталиРасшифровки.Вставить("Периодичность", Отчет.Периодичность);
		ДеталиРасшифровки.Вставить("ИмяСхемы", "BillingDashboardLeg7");

		
		// открываем детализирующий отчет
		ОткрытьФорму("Отчет.DashboardsDetalization.Форма.ФормаОтчета", Новый Структура("Отбор", ДеталиРасшифровки), ЭтаФорма, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка, ДеталиРасшифровки, ВариантРасшифровки) 
	
	Данные = Неопределено;
	
	Если ВариантРасшифровки = 1 Тогда
		Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);    
	ИначеЕсли ВариантРасшифровки = 2 Тогда
		Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиТаб1);    
	Иначе
		Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиТаб2);    
	КонецЕсли;
	
	ПолучитьЗначенияРасшифровки(Данные, ДеталиРасшифровки, Расшифровка);
	
КонецФункции 

&НаСервереБезКонтекста
Процедура ПолучитьЗначенияРасшифровки(Данные, ДеталиРасшифровки, Расшифровка)
	
	ЭлементРасшифровкиДанных = Данные.Элементы.Получить(Расшифровка);
	
	// выбираем поля. Если это группа, то обходим ее рекурсивно
	Если ТипЗнч(ЭлементРасшифровкиДанных) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля(); 
	
		Для каждого ТекПоле из Поля Цикл
			ДеталиРасшифровки.Вставить(ТекПоле.Поле, ТекПоле.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// далее просматриваем родителей
	Родители = ЭлементРасшифровкиДанных.ПолучитьРодителей(); 
	
	Для каждого Родитель из Родители Цикл
		
		ПолучитьЗначенияРасшифровки(Данные, ДеталиРасшифровки, Родитель.Идентификатор);
		
	КонецЦикла;
	
КонецПроцедуры
